# Pandas DataFrames - Writing to and Reading From MySQL Table

## Writing Data from MySQL database table into pandas dataframe

Base on the article from Antony Christopher (https://medium.com/analytics-vidhya/importing-data-from-a-mysql-database-into-pandas-data-frame-a06e392d27d7).

In [1]:
from sqlalchemy import create_engine
import mysql.connector as mysql
import pandas as pd

In [2]:
#connecting to the database, takes 3 requirements
try:
    db = mysql.connect(
    host='127.0.0.1',
    user='root',
    password='*Saltlake5',
    database='natural_gas')
    
    query = 'SELECT * FROM natural_gas;'
    result_dataFrame = pd.read_sql(query, db)
    db.close() #close the connection

except Exception as e:
    db.close()
    print(str(e))

print(result_dataFrame)

     natural_gas_id     date  price  year month
0                 1  1997-01   3.45  1997    01
1                 2  1997-02   2.15  1997    02
2                 3  1997-03   1.89  1997    03
3                 4  1997-04   2.03  1997    04
4                 5  1997-05   2.25  1997    05
..              ...      ...    ...   ...   ...
279             280  2020-04   1.74  2020    04
280             281  2020-05   1.75  2020    05
281             282  2020-06   1.63  2020    06
282             283  2020-07   1.77  2020    07
283             284  2020-08   2.30  2020    08

[284 rows x 5 columns]

#### Explenation on connection and reading the data with pandas:

mysql.connector provides all the database manipulation using python. Let get deeper on code logic implementation.

connection.connect(host, database, user, password,use_pure)

host — provides the hostName of MySQL server. Normally, if we do install in our machine locally then it termed as ‘localhost’. Cases like cloud / dedicated third party server provide the IP address there.

database- Provides the name of the database to do manipulation.

user & password- The credentials to access the database. Normally all database having the credentials set up to make it secure access.

use_pure — Symbolize Python implementation

pandas.read_sql(sql, con)

Read SQL query or database table into a DataFrame.

sql — SQL query to be executed or a table name.

con — Using SQLAlchemy makes it possible to use any DB supported by that library. If a DBAPI2 object, only sqlite3 is supported. The user is responsible for engine disposal and connection closure for the SQLAlchemy connectable.

In [3]:
#utilyzing pandas features
result_dataFrame.head()

   natural_gas_id     date  price  year month
0               1  1997-01   3.45  1997    01
1               2  1997-02   2.15  1997    02
2               3  1997-03   1.89  1997    03
3               4  1997-04   2.03  1997    04
4               5  1997-05   2.25  1997    05

## Exporting Dataset to CSV

In [4]:
result_dataFrame.to_csv('data/Test.csv')

In [5]:
df_csv = pd.read_csv('data/Test.csv')
df_csv

     Unnamed: 0  natural_gas_id     date  price  year  month
0             0               1  1997-01   3.45  1997      1
1             1               2  1997-02   2.15  1997      2
2             2               3  1997-03   1.89  1997      3
3             3               4  1997-04   2.03  1997      4
4             4               5  1997-05   2.25  1997      5
..          ...             ...      ...    ...   ...    ...
279         279             280  2020-04   1.74  2020      4
280         280             281  2020-05   1.75  2020      5
281         281             282  2020-06   1.63  2020      6
282         282             283  2020-07   1.77  2020      7
283         283             284  2020-08   2.30  2020      8

[284 rows x 6 columns]

## Questions over the dataset:
#### What years are available in this dataset

#### what is the mean price of each year?

#### What is the mean price of each month?

#### How many of this inputs had a price lower then 2?